const schedulesData = {
    "КН-31": {
      
        faculty: "КН", // Додаємо поле faculty
        schedule: [
        {
            date: "24.02.2025", day: "Понеділок", lessons: [
                { time: "09:00-10:20", subject: "", teacher: "", group: "" },
                { time: "10:35-11:55", subject: "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)", teacher: "Ізмайлов А.В.", group: "КН(зб)2.23", details: "ауд. 318 кор. Центральний корпус, Шевченка 57" },
                { time: "12:20-13:40", subject: "Економіка (Сем)", teacher: "Кушнір* О.С.", group: "", details: "ауд. 310 кор. Центральний корпус, Шевченка 57" },
                { time: "13:50-15:10", subject: "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)", teacher: "Горєлов В.О.", group: "КН(зб)2.20", details: "ауд. 313 кор. Центральний корпус, Шевченка 57" },
                { time: "15:20-16:40", subject: "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)", teacher: "Семаньків М.В.", group: "КН(зб)2.31", details: "ауд. 230 кор. Центральний корпус, Шевченка 57" },
                { time: "16:50-18:10", subject: "", teacher: "", group: "" },
                { time: "18:15-19:35", subject: "", teacher: "", group: "" },
                { time: "19:40-21:00", subject: "", teacher: "", group: "" }
            ]
        },
        {
            date: "25.02.2025", day: "Вівторок", lessons: [
                { time: "09:00-10:20", subject: "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)", teacher: "Ізмайлов А.В.", group: "КН(зб)2.24", details: "ауд. 207 кор. Центральний корпус, Шевченка 57" },
                { time: "10:35-11:55", subject: "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)", teacher: "Ізмайлов А.В.", group: "КН(зб)2.25", details: "ауд. 307а кор. Центральний корпус, Шевченка 57" },
                { time: "12:20-13:40", subject: "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)", teacher: "Ізмайлов А.В.", group: "КН(зб)2.26", details: "ауд. 309а кор. Центральний корпус, Шевченка 57" },
                { time: "13:50-15:10", subject: "", teacher: "", group: "" },
                { time: "15:20-16:40", subject: "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)", teacher: "Горєлов В.О.", group: "КН(зб)2.22", details: "ауд. 313 кор. Центральний корпус, Шевченка 57" },
                { time: "16:50-18:10", subject: "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)", teacher: "Горєлов В.О.", group: "КН(зб)2.22", details: "ауд. 313 кор. Центральний корпус, Шевченка 57" },
                { time: "18:15-19:35", subject: "", teacher: "", group: "" },
                { time: "19:40-21:00", subject: "", teacher: "", group: "" }
            ]
        },
        {
            date: "26.02.2025", day: "Середа", lessons: [
                { time: "09:00-10:20", subject: "Потік КН-31, КН-32\nАналіз даних (Л)", teacher: "Ізмайлов А.В.", group: "КН-31, КН-32", details: "ауд. 310 кор. Центральний корпус, Шевченка 57" },
                { time: "10:35-11:55", subject: "(підгр. 1)\nАналіз даних (Лаб)", teacher: "Ізмайлов А.В.", group: "КН-31 (підгр. 1)", details: "ауд. 320 кор. Центральний корпус, Шевченка 57" },
                { time: "12:20-13:40", subject: "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)", teacher: "Никифорчин О.Р.", group: "КН(зб)2.28", details: "ауд. 404 кор. Центральний корпус, Шевченка 57" },
                { time: "13:50-15:10", subject: "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)", teacher: "Горєлов В.О.", group: "КН(зб)2.19", details: "ауд. 313 кор. Центральний корпус, Шевченка 57" },
                { time: "15:20-16:40", subject: "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)", teacher: "Горєлов В.О.", group: "КН(зб)2.20", details: "ауд. 313 кор. Центральний корпус, Шевченка 57" },
                { time: "16:50-18:10", subject: "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)", teacher: "Горєлов В.О.", group: "КН(зб)2.21", details: "ауд. 313 кор. Центральний корпус, Шевченка 57" },
                { time: "18:15-19:35", subject: "Збірна група ТМ-зб6\nТайм- менеджмент (Л)", teacher: "Колєдіна К.О.", group: "ТМ-зб6", details: "дист. http://meet.google.com/emj-cmiw-tqm" },
                { time: "19:40-21:00", subject: "", teacher: "", group: "" }
            ]
        },
        {
           "date": "27.02.2025",
            "day": "Четвер",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                "teacher": "Семаньків М.В.",
                "group": "КН(зб)2.32",
                "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                "teacher": "Семаньків М.В.",
                "group": "КН(зб)2.29",
                "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                "teacher": "Никорак Я.Я.",
                "group": "КН-31, КН-32",
                "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                "teacher": "Никорак Я.Я.",
                "group": "КН-31 (підгр. 1)",
                "details": "ауд. 112 кор. Гуманітарний корпус"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                "teacher": "Дудкевич В.І.",
                "group": "SS-зб4",
                "details": "дист. https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
        {
            "date": "28.02.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31, КН-32",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.23",
                "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
        {
            "date": "03.03.2025",
            "day": "Понеділок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                "teacher": "Кушнір* О.С.",
                "group": "КН-31, КН-32",
                "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                "teacher": "Семаньків М.В.",
                "group": "КН(зб)2.30",
                "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
        {
            "date": "04.03.2025",
            "day": "Вівторок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.24",
                "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.25",
                "details": "ауд. 112 кор. Гуманітарний корпус"
              },
              {
                "time": "13:50-15:10",
                "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.26",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
          {
            "date": "05.03.2025",
            "day": "Середа",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                "teacher": "Никифорчин О.Р.",
                "group": "КН(зб)2.28",
                "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.19",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.20",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.21",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (Л)",
                "teacher": "Колєдіна К.О.",
                "group": "ТМ-зб6",
                "details": "дист. http://meet.google.com/emj-cmiw-tqm"
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
        {
            "date": "06.03.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.32",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.23",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                    "teacher": "Дудкевич В.І.",
                    "group": "SS-зб4",
                    "details": "дист. https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "07.03.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 1)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
        {
            "date": "10.03.2025",
            "day": "Понеділок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.23",
                "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Економіка (Сем)",
                "teacher": "Кушнір* О.С.",
                "group": "",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.20",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                "teacher": "Семаньків М.В.",
                "group": "КН(зб)2.31",
                "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
          {
            "date": "11.03.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.22",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.22",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "12.03.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.19",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "13.03.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.32",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.29",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                    "teacher": "Дудкевич В.І.",
                    "group": "SS-зб4",
                    "details": "дист. https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "14.03.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31, КН-32",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.23",
                "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
          {
            "date": "17.03.2025",
            "day": "Понеділок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                "teacher": "Кушнір* О.С.",
                "group": "КН-31, КН-32",
                "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                "teacher": "Семаньків М.В.",
                "group": "КН(зб)2.30",
                "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
        {
            "date": "18.03.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.22",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.22",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "19.03.2025",
            "day": "Середа",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                "teacher": "Никифорчин О.Р.",
                "group": "КН(зб)2.28",
                "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.19",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.20",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.21",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (Л)",
                "teacher": "Колєдіна К.О.",
                "group": "ТМ-зб6",
                "details": "дист. http://meet.google.com/emj-cmiw-tqm"
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
        {
            "date": "20.03.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.30",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.23",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                    "teacher": "Дудкевич В.І.",
                    "group": "SS-зб4",
                    "details": "дист. https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
                {
            "date": "21.03.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб) ауд. 313 кор. Центральний корпус, Шевченка 57\n(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Ровінський В.А., Превисокова Н.В.",
                "group": "КН(зб)2.27, КН-31 (підгр. 1)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": "дист. https://meet.google.com/uvz-phzq-qaf"
              }
            ]
          },
        {
            "date": "24.03.2025",
            "day": "Понеділок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.23",
                    "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Економіка (Сем)",
                    "teacher": "Кушнір* О.С.",
                    "group": "",
                    "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.31",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "25.03.2025",
            "day": "Вівторок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.26",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.24",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "13:50-15:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
          {
            "date": "26.03.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.19",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "27.03.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.32",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.29",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                  },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "28.03.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31, КН-32",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "",
                "teacher": "",
                "group": ""
                },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": "дист. https://meet.google.com/uvz-phzq-qaf"
              }
            ]
        },
        {
            "date": "31.03.2025",
            "day": "Понеділок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                    "teacher": "Кушнір* О.С.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Практикум з програмування (ПрС)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.30",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "01.04.2025",
            "day": "Вівторок",
            "lessons": [
                {
                  "time": "09:00-10:20",
                  "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                  "teacher": "Ізмайлов А.В.",
                  "group": "КН(зб)2.25",
                  "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "10:35-11:55",
                  "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                  "teacher": "Ізмайлов А.В.",
                  "group": "КН(зб)2.26",
                  "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "12:20-13:40",
                  "subject": "",
                  "teacher": "",
                  "group": ""
                },
                {
                  "time": "13:50-15:10",
                  "subject": "",
                  "teacher": "",
                  "group": ""
                },
                {
                  "time": "15:20-16:40",
                  "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                  "teacher": "Горєлов В.О.",
                  "group": "КН(зб)2.22",
                  "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "16:50-18:10",
                  "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                  "teacher": "Горєлов В.О.",
                  "group": "КН(зб)2.22",
                  "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "18:15-19:35",
                  "subject": "",
                  "teacher": "",
                  "group": ""
                },
                {
                  "time": "19:40-21:00",
                  "subject": "",
                  "teacher": "",
                  "group": ""
                }
              ]
        },
        {
            "date": "02.04.2025",
            "day": "Середа",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                "teacher": "Никифорчин О.Р.",
                "group": "КН(зб)2.28",
                "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.19",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.20",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.21",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (Л)",
                "teacher": "Колєдіна К.О.",
                "group": "ТМ-зб6",
                "details": "дист. http://meet.google.com/emj-cmiw-tqm"
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
        {
            "date": "03.04.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.31",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
              ]
        },
        {
            "date": "04.04.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб) ауд. 313 кор. Центральний корпус, Шевченка 57\n(підгр. 1) Комп`ютерні мережі (Лаб)",
                "teacher": "Ровінський В.А., Превисокова Н.В.",
                "group": "КН(зб)2.27,  КН-31 (підгр. 1)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": "дист. https://meet.google.com/uvz-phzq-qaf"
              }
            ]
          },
        {
            "date": "07.04.2025",
            "day": "Понеділок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.23",
                    "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.31",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "08.04.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.22",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "09.04.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.19",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "10.04.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.32",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.29",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                  },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {"date": "11.04.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31, КН-32",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": "дист. https://meet.google.com/uvz-phzq-qaf"
              }
            ]
          },
        {
            "date": "16.04.2025",  // Змінено на середу, бо пропустили
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (КСР)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "17.04.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
          ]
        },
        {
            "date": "21.04.2025",
            "day": "Понеділок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.23",
                    "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Економіка (Сем)",
                    "teacher": "Кушнір* О.С.",
                    "group": "",
                    "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.31",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "22.04.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.22",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "16:50-18:10",
                  "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                  "teacher": "Горєлов В.О.",
                  "group": "КН(зб)2.22",
                  "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "23.04.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.19",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "18:15-19:35",
                  "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС) дист. https://meet.google.com/gqw-tsfv-ntg\nЗбірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                  "teacher": "Паска Ю.В., Колєдіна К.О.",
                  "group": "ІПтаРС-зб1, ТМ-зб6",
                  "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (Л)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": ""
                }
            ]
        },
        {
            "date": "24.04.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.32",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.29",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                  },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "25.04.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31, КН-32",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "",
                "teacher": "",
                "group": ""
                },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
                {
            "date": "28.04.2025",
            "day": "Понеділок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                    "teacher": "Кушнір* О.С.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Економіка (Сем)",
                    "teacher": "Кушнір* О.С.",
                    "group": "",
                    "details": "ауд. 324 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.30",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "29.04.2025",
            "day": "Вівторок",
            "lessons": [
               {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                  "time": "15:20-16:40",
                  "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                  "teacher": "Горєлов В.О.",
                  "group": "КН(зб)2.22",
                  "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "16:50-18:10",
                  "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                  "teacher": "Горєлов В.О.",
                  "group": "КН(зб)2.22",
                  "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "30.04.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                  },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "01.05.2025",
            "day": "Четвер",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.24",
                "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.25",
                "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "02.05.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб) ауд. 313 кор. Центральний корпус, Шевченка 57\n(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Ровінський В.А., Превисокова Н.В.",
                "group": "КН(зб)2.27, КН-31(підгр. 1)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
        {
            "date": "05.05.2025",
            "day": "Понеділок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "",
                "teacher": "",
                "group": ""
              },
                {
                    "time": "12:20-13:40",
                    "subject": "Економіка (Сем)",
                    "teacher": "Кушнір* О.С.",
                    "group": "",
                    "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                },
              {
                "time": "13:50-15:10",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                "teacher": "Семаньків М.В.",
                "group": "КН(зб)2.31",
                "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
              },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "06.05.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "07.05.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "18:15-19:35",
                  "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС) дист. https://meet.google.com/gqw-tsfv-ntg\nЗбірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                  "teacher": "Паска Ю.В., Колєдіна К.О.",
                  "group": "ІПтаРС-зб1, ТМ-зб6",
                  "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "08.05.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.32",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.29",
                    "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31, КН-32",
                    "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                  },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "09.05.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31, КН-32",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "",
                "teacher": "",
                "group": ""
                },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
        {
            "date": "12.05.2025",
            "day": "Понеділок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "12:20-13:40",
                "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                "teacher": "Кушнір* О.С.",
                "group": "КН-31, КН-32",
                "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Економіка (Сем)",
                "teacher": "Кушнір* О.С.",
                "group": "",
                "details": "ауд. 324 кор. Центральний корпус, Шевченка 57"
              },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.30",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "13.05.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                },
              {
                "time": "15:20-16:40",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "16:50-18:10",
                "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                "teacher": "Горєлов В.О.",
                "group": "КН(зб)2.22",
                "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
              },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "14.05.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "15.05.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "16.05.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS (Лаб) ауд. 313 кор. Центральний корпус, Шевченка 57\n(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Ровінський В.А., Превисокова Н.В.",
                "group": "КН(зб)2.27, КН-31 (підгр. 1)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
          },
        {
            "date": "19.05.2025",
            "day": "Понеділок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН(зб)2.26",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
              },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.31",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "20.05.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.22",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "21.05.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "18:15-19:35",
                  "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС) дист. https://meet.google.com/gqw-tsfv-ntg\nЗбірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                  "teacher": "Паска Ю.В., Колєдіна К.О.",
                  "group": "ІПтаРС-зб1, ТМ-зб6",
                  "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "22.05.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.32",
                    "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 1)",
                    "details": "ауд. 112 кор. Гуманітарний корпус"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "23.05.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 1)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                "teacher": "Матвієнків С.М.",
                "group": "SS-зб4",
                "details": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
         {
            "date": "26.05.2025",
            "day": "Понеділок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Економіка (Сем)",
                    "teacher": "Кушнір* О.С.",
                    "group": "",
                    "details": "ауд. 324 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                    "teacher": "Семаньків М.В.",
                    "group": "КН(зб)2.30",
                    "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "27.05.2025",
            "day": "Вівторок",
            "lessons": [
               {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                  "time": "15:20-16:40",
                  "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                  "teacher": "Горєлов В.О.",
                  "group": "КН(зб)2.22",
                  "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                  "time": "16:50-18:10",
                  "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                  "teacher": "Горєлов В.О.",
                  "group": "КН(зб)2.22",
                  "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "28.05.2025",
            "day": "Середа",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                    "teacher": "Никифорчин О.Р.",
                    "group": "КН(зб)2.28",
                    "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.20",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "16:50-18:10",
                    "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                    "teacher": "Горєлов В.О.",
                    "group": "КН(зб)2.21",
                    "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                },
               {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (ПрС)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": "дист. http://meet.google.com/emj-cmiw-tqm"
                  },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "29.05.2025",
            "day": "Четвер",
            "lessons": [
               {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                    "teacher": "Паска Ю.В.",
                    "group": "ІПтаРС-зб1",
                    "details": "дист. https://meet.google.com/gqw-tsfv-ntg"
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "30.05.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Практикум з програмування (ПрС)",
                "teacher": "Ізмайлов А.В.",
                "group": "",
                "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                "teacher": "Ровінський В.А.",
                "group": "КН(зб)2.27",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "Збірна група КН(зб)2.27\nПрограмування iOS (Лаб) ауд. 313 кор. Центральний корпус, Шевченка 57\n(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Ровінський В.А., Превисокова Н.В.",
                "group": "КН(зб)2.27,  КН-31 (підгр. 1)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "13:50-15:10",
                "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31 (підгр. 2)",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "15:20-16:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "16:50-18:10",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "18:15-19:35",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "19:40-21:00",
                "subject": "",
                "teacher": "",
                "group": ""
              }
            ]
        },
        {
            "date": "02.06.2025",
            "day": "Понеділок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
                {
            "date": "03.06.2025",
            "day": "Вівторок",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "04.06.2025",
            "day": "Середа",
            "lessons": [
               {
                    "time": "09:00-10:20",
                    "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.24",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.25",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН(зб)2.26",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "Збірна група ТМ-зб6\nТайм- менеджмент (КСР)",
                    "teacher": "Колєдіна К.О.",
                    "group": "ТМ-зб6",
                    "details": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "05.06.2025",
            "day": "Четвер",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Практикум з програмування (ПрС)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "",
                    "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "12:20-13:40",
                    "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                    "teacher": "Никорак Я.Я.",
                    "group": "КН-31 (підгр. 2)",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "06.06.2025",
            "day": "П'ятниця",
            "lessons": [
                {
                    "time": "09:00-10:20",
                    "subject": "Аналіз даних... Письм.Екз.- за групу (КЕк)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31",
                    "details": "ауд. 316 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "10:35-11:55",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "12:20-13:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "09.06.2025",
            "day": "Понеділок",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "",
                "teacher": "",
                "group": ""
              },
                {
                    "time": "12:20-13:40",
                    "subject": "Аналіз даних... Письм.Екз.- за групу (Екз)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31",
                    "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "13:50-15:10",
                    "subject": "Практикум з програмування... Письм.Екз.- за групу (КЕк)",
                    "teacher": "Ізмайлов А.В.",
                    "group": "КН-31",
                    "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "13.06.2025",
            "day": "П'ятниця",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "Практикум з програмування... Письм.Екз.- за групу (Екз)",
                "teacher": "Ізмайлов А.В.",
                "group": "КН-31",
                "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "10:35-11:55",
                "subject": "Комп`ютерні мережі... Письм.Екз.- за групу (КЕк)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31",
                "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        },
        {
            "date": "18.06.2025",
            "day": "Середа",
            "lessons": [
              {
                "time": "09:00-10:20",
                "subject": "",
                "teacher": "",
                "group": ""
              },
              {
                "time": "10:35-11:55",
                "subject": "Комп`ютерні мережі... Письм.Екз.- за групу (Екз)",
                "teacher": "Превисокова Н.В.",
                "group": "КН-31",
                "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
              },
              {
                "time": "12:20-13:40",
                "subject": "",
                "teacher": "",
                "group": ""
              },
                {
                    "time": "13:50-15:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "15:20-16:40",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "16:50-18:10",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "18:15-19:35",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                },
                {
                    "time": "19:40-21:00",
                    "subject": "",
                    "teacher": "",
                    "group": ""
                }
            ]
        }
    ]
    }

};
