const schedulesData = 
{
    "КН-31": {
        "faculty": "КН",
        "schedule": [
            {
                "date": "18.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "19.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "20.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 33 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "https://us05web.zoom.us/j/792269..."
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "https://us05web.zoom.us/j/792269..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "21.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "24.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "25.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "26.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "27.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "https://us05web.zoom.us/j/792269..."
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "28.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "03.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                        "teacher": "Кушнір* О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "04.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "05.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "06.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "https://us05web.zoom.us/j/792269..."
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "07.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "10.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "11.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "12.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "13.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "https://us05web.zoom.us/j/792269..."
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "14.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "17.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                        "teacher": "Кушнір* О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "18.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "19.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-...\nдист.\nЗбірна група BE-зб5\nBusiness English (ПрС)\nТуровська Л.В.\nhttps://meet.google.com/mka-xhtg..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "20.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "https://us05web.zoom.us/j/792269..."
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "21.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57 (підгр. 1)\nКомп`ютерні мережі (Лаб)\nауд. 207 кор. Центральний корпус, Шевченка 57\nПревисокова Н.В."
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "https://meet.google.com/uvz-phzq..."
                    }
                ]
            },
            {
                "date": "24.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "25.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "26.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "27.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "28.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "https://meet.google.com/uvz-phzq..."
                    }
                ]
            },
            {
                "date": "31.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                        "teacher": "Кушнір* О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "01.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "02.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-...\nдист.\nЗбірна група BE-зб5\nBusiness English (ПрС)\nТуровська Л.В.\nhttps://meet.google.com/mka-xhtg..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": ""
                    }
                ]
            },
            {
                "date": "03.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "04.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57 (підгр. 1)\nКомп`ютерні мережі (Лаб)\nауд. 207 кор. Центральний корпус, Шевченка 57\nПревисокова Н.В."
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "https://meet.google.com/uvz-phzq..."
                    }
                ]
            },
            {
                "date": "07.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "08.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "09.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "10.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "11.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "https://meet.google.com/uvz-phzq..."
                    }
                ]
            },
            {
                "date": "16.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (КСР)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "17.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "21.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "22.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "23.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv...\nдист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)\nКолєдіна К.О.\nhttp://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ТМ-зб6\nТайм-  менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)\nТуровська Л.В.\nhttps://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "24.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "25.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "28.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                        "teacher": "Кушнір* О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "29.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "30.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "01.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "02.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57 (підгр. 1)\nКомп`ютерні мережі (Лаб)\nауд. 207 кор. Центральний корпус, Шевченка 57\nПревисокова Н.В."
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "05.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "06.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "07.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv...\nдист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)\nКолєдіна К.О.\nhttp://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "08.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "09.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "12.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                        "teacher": "Кушнір* О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "13.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "14.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "15.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "16.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57 (підгр. 1)\nКомп`ютерні мережі (Лаб)\nауд. 207 кор. Центральний корпус, Шевченка 57\nПревисокова Н.В."
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "19.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "20.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "21.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv...\nдист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)\nКолєдіна К.О.\nhttp://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "22.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 112 кор. Гуманітарний корпус"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "23.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 1)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4\nSoft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "26.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Економіка (Сем)",
                        "teacher": "Кушнір* О.С.",
                        "group": "",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "27.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "28.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ТМ-зб6\nТайм-  менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg..."
                    }
                ]
            },
            {
                "date": "29.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "дист.\nЗбірна група ІПтаРС-зб1\nІнноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "РС-зб1",
                        "details": "https://meet.google.com/gqw-tsfv..."
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "30.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57 (підгр. 1)\nКомп`ютерні мережі (Лаб)\nауд. 207 кор. Центральний корпус, Шевченка 57\nПревисокова Н.В."
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "02.06.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "03.06.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "04.06.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6\nТайм-  менеджмент (КСР)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "05.06.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31 (підгр. 2)",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "06.06.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Аналіз даних... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КЕк)",
                        "details": "ауд. 316 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "09.06.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Аналіз даних... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Практикум з програмування... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КЕк)",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "13.06.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Практикум з програмування... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Комп`ютерні мережі... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КЕк)",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            },
            {
                "date": "18.06.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Комп`ютерні мережі... Письм.Екз.- за групу (Екз)",
                        "teacher": "Превисокова Н.В.",
                        "group": "",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "",
                        "teacher": "",
                        "group": "",
                        "details": ""
                    }
                ]
            }
        ]
    },
        "КН-32": {
            "faculty": "КН",
            "schedule": [
                {
                    "date": "18.02.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "19.02.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "20.02.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 33 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 35 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "21.02.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "24.02.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "25.02.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "26.02.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "27.02.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.29",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "дист.\nЗбірна група Уфсо-3зб\nСоціологія (Л)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": "https://meet.google.com/khj-wrua..."
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "28.02.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "03.03.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                            "teacher": "Кушнір* О.С.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Економіка (Сем)",
                            "teacher": "Кушнір* О.С.",
                            "group": "",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.30",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "04.03.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "05.03.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "06.03.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 35 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (Л)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "07.03.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "10.03.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "11.03.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "12.03.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "13.03.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.29",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (Л)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "14.03.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "17.03.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                            "teacher": "Кушнір* О.С.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Економіка (Сем)",
                            "teacher": "Кушнір* О.С.",
                            "group": "",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.30",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "18.03.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "19.03.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "20.03.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.30",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (Л)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "21.03.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "24.03.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "25.03.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "26.03.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "27.03.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.29",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (Л)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "28.03.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "31.03.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                            "teacher": "Кушнір* О.С.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Економіка (Сем)",
                            "teacher": "Кушнір* О.С.",
                            "group": "",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.30",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "01.04.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 320а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "02.04.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "Збірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "03.04.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (Л)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "04.04.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "07.04.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "08.04.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "09.04.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "10.04.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.29",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "11.04.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "16.04.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "17.04.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "21.04.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.23\nWEB - програмування (JavaScript) (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.23",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "22.04.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "23.04.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Потік КН-31, КН-32\nАналіз даних (Л)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.19\nТехнології проектування комп’ютерних ігор (Unity) (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.19",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "24.04.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.29",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "25.04.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "28.04.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                            "teacher": "Кушнір* О.С.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.30",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "29.04.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "30.04.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "01.05.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "02.05.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "05.05.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Економіка (Сем)",
                            "teacher": "Кушнір* О.С.",
                            "group": "",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "06.05.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "07.05.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Л)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "08.05.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.29\nКрос-платформне програмування (Python) (Л)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.29",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nОпераційні системи (Л)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "(підгр. 2)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "09.05.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nКомп`ютерні мережі (Л)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "12.05.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Потік КН-31, КН-32\nЕкономіка (Л)",
                            "teacher": "Кушнір* О.С.",
                            "group": "КН-31, КН-32",
                            "details": "ауд. 318 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.30",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "13.05.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 112 кор. Гуманітарний корпус"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "14.05.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 1)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Економіка (Сем)",
                            "teacher": "Кушнір* О.С.",
                            "group": "",
                            "details": "ауд. 232 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "15.05.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 322 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "16.05.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "19.05.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Економіка (Сем)",
                            "teacher": "Кушнір* О.С.",
                            "group": "",
                            "details": "ауд. 402 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.31\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.31",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "20.05.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "21.05.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "(підгр. 2)\nКомп`ютерні мережі (Лаб)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "22.05.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.32\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.32",
                            "details": "ауд. 234 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 2)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 2)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "23.05.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Л)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 310 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "26.05.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.30\nКрос-платформне програмування (Python) (Лаб)",
                            "teacher": "Семаньків М.В.",
                            "group": "КН(зб)2.30",
                            "details": "ауд. 230 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "27.05.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 320 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Л)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.22\nТехнології розробки мобільних додатків (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.22",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "28.05.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.28\nАлгоритми на графах (Лаб)",
                            "teacher": "Никифорчин О.Р.",
                            "group": "КН(зб)2.28",
                            "details": "ауд. 404 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Економіка (Сем)",
                            "teacher": "Кушнір* О.С.",
                            "group": "",
                            "details": "ауд. 232 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "Збірна група КН(зб)2.20\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.20",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "Збірна група КН(зб)2.21\nТехнології проектування комп’ютерних ігор (Unity) (Лаб)",
                            "teacher": "Горєлов В.О.",
                            "group": "КН(зб)2.21",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "дист.\nЗбірна група BE-зб5\nBusiness English (ПрС)",
                            "teacher": "Туровська Л.В.",
                            "group": "BE-зб5",
                            "details": "https://meet.google.com/mka-xhtg..."
                        }
                    ]
                },
                {
                    "date": "29.05.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 309а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307а кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "Збірна група Уфсо-3зб\nСоціологія (ПрС)",
                            "teacher": "Кучера І.В.",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "30.05.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.27\nПрограмування iOS  (Лаб)",
                            "teacher": "Ровінський В.А.",
                            "group": "КН(зб)2.27",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "02.06.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "03.06.2025",
                    "day": "Вівторок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "04.06.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "Збірна група КН(зб)2.24\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.24",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Збірна група КН(зб)2.25\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.25",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Збірна група КН(зб)2.26\nWEB - програмування (JavaScript) (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН(зб)2.26",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "05.06.2025",
                    "day": "Четвер",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "(підгр. 1)\nОпераційні системи (Лаб)",
                            "teacher": "Никорак Я.Я.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "(підгр. 1)\nАналіз даних (Лаб)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КН-32 (підгр. 1)",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "06.06.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Практикум з програмування (ПрС)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 207 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "Комп`ютерні мережі... Письм.Екз.- за групу (КЕк)",
                            "teacher": "Превисокова Н.В.",
                            "group": "КЕк)",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "11.06.2025",
                    "day": "Середа",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Комп`ютерні мережі... Письм.Екз.- за групу (Екз)",
                            "teacher": "Превисокова Н.В.",
                            "group": "",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "13.06.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Аналіз даних... Письм.Екз.- за групу (КЕк)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КЕк)",
                            "details": "ауд. 313 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "16.06.2025",
                    "day": "Понеділок",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "Аналіз даних... Письм.Екз.- за групу (Екз)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 309 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Практикум з програмування... Письм.Екз.- за групу (КЕк)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "КЕк)",
                            "details": "ауд. 306 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                },
                {
                    "date": "20.06.2025",
                    "day": "П'ятниця",
                    "lessons": [
                        {
                            "time": "09:00-10:20",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "10:35-11:55",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "12:20-13:40",
                            "subject": "Практикум з програмування... Письм.Екз.- за групу (Екз)",
                            "teacher": "Ізмайлов А.В.",
                            "group": "",
                            "details": "ауд. 307 кор. Центральний корпус, Шевченка 57"
                        },
                        {
                            "time": "13:50-15:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "15:20-16:40",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "16:50-18:10",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "18:15-19:35",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        },
                        {
                            "time": "19:40-21:00",
                            "subject": "",
                            "teacher": "",
                            "group": "",
                            "details": ""
                        }
                    ]
                }
            ]
        }
    };