// "ПР-34": {
//     "faculty": "ПР",
//     "schedule": [
//         {
//             "date": "17.02.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Збірна група ПР(захтр)л\nЗахист трудових прав працівників (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "18.02.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 402 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "19.02.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(захтр)л\nЗахист трудових прав працівників (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(псз)л\nПраво соціального забезпечення (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "20.02.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 309 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "21.02.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (Л)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 308 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 309 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "24.02.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "дист.\nЗбірна група ПР(квп)л\nКримінально-виконавче право (Л)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а http://meet.google.com/smf-qirh-...",
//                     "link": "http://meet.google.com/smf-qirh-bsu"
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "дист.\nПотік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а https://meet.google.com/imo-ubqj...",
//                     "link": "https://meet.google.com/imo-ubqj-deu"
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "дист.\nЦивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 210 кор. Шевченка, 44а https://meet.google.com/xsg-figs...",
//                     "link": "https://meet.google.com/xsg-figs-sta"
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "дист.\nКримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 103 кор. Шевченка, 44а https://meet.google.com/kka-yhcq...",
//                     "link": "https://meet.google.com/kka-yhcq-zdj"
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "25.02.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "дист.\nЦивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 208 кор. Шевченка, 44а https://meet.google.com/ujs-muse...",
//                     "link": "https://meet.google.com/ujs-muse-asm"
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "дист.\nПотік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 402 кор. Шевченка, 44а https://meet.google.com/bht-veak...",
//                     "link": "https://meet.google.com/bht-veak-xce"
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "дист.\nПотік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а http://meet.google.com/trk-hyds-...",
//                     "link": "http://meet.google.com/trk-hyds-cvb"
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "26.02.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "дист.\nПотік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 406 кор. Шевченка, 44а https://meet.google.com/iog-jjji...",
//                     "link": "https://meet.google.com/iog-jjji-jpk"
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "дист.\nКримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а https://teams.live.com/meet/9475...",
//                     "link": "https://teams.live.com/meet/9475689210338?p=GTM9yrN2TMzpejehHN"
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "27.02.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "дист.\nЗбірна група ПР(псз)л\nПраво соціального забезпечення (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а http://meet.google.com/vtx-pwtq-...",
//                     "link": "http://meet.google.com/vtx-pwtq-yae"
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "дист.\nЗбірна група ПР(квп)л\nКримінально-виконавче право (Л)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а http://meet.google.com/smf-qirh-...",
//                     "link": "http://meet.google.com/smf-qirh-bsu"
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "дист.\nЗбірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а http://meet.google.com/smf-qirh-...",
//                     "link": "http://meet.google.com/smf-qirh-bsu"
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "28.02.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "дист.\nЗбірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 103 кор. Шевченка, 44а https://meet.google.com/xzw-mwwn...",
//                     "link": "https://meet.google.com/xzw-mwwn-mkd"
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "дист.\nПотік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 402 кор. Шевченка, 44а https://meet.google.com/bht-veak...",
//                     "link": "https://meet.google.com/bht-veak-xce"
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "дист.\nПотік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а http://meet.google.com/trk-hyds-...",
//                     "link": "http://meet.google.com/trk-hyds-cvb"
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "дист.\nКримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а https://teams.live.com/meet/9475...",
//                     "link": "https://teams.live.com/meet/9475689210338?p=GTM9yrN2TMzpejehHN"
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "03.03.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 113 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Збірна група ПР(псз)л\nПраво соціального забезпечення (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "04.03.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "05.03.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 113 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "06.03.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 111 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(захтр)3\nЗахист трудових прав працівників (ПрС)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "ПР(захтр)3",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "07.03.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (Л)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 308 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 0-102 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(псз)2\nПраво соціального забезпечення (ПрС)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "ПР(псз)2",
//                     "details": "ауд. 402 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "10.03.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(захтр)л\nЗахист трудових прав працівників (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 407 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 309 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 111 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "11.03.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 402 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "12.03.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(псз)2\nПраво соціального забезпечення (ПрС)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "ПР(псз)2",
//                     "details": "ауд. 407 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "13.03.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(псз)л\nПраво соціального забезпечення (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(квп)л\nКримінально-виконавче право (Л)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "14.03.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 113 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(захтр)3\nЗахист трудових прав працівників (ПрС)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "ПР(захтр)3",
//                     "details": "ауд. 0-100 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 113 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "17.03.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "18.03.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "19.03.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "20.03.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(псз)2\nПраво соціального забезпечення (ПрС)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "ПР(псз)2",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "21.03.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (Л)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 308 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 0-102 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "24.03.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(захтр)л\nЗахист трудових прав працівників (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 407 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "25.03.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 402 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "26.03.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(захтр)3\nЗахист трудових прав працівників (ПрС)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "ПР(захтр)3",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 0-102 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "27.03.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(псз)л\nПраво соціального забезпечення (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(квп)л\nКримінально-виконавче право (Л)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "28.03.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 113 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(псз)2\nПраво соціального забезпечення (ПрС)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "ПР(псз)2",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "31.03.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 308 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "01.04.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "02.04.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(захтр)л\nЗахист трудових прав працівників (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 407 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "03.04.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 111 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Кримінальне процесуальне право України (ПрС)",
//                     "teacher": "Гнідан Р.М.",
//                     "group": "",
//                     "details": "ауд. 0-100 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "04.04.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (Л)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 308 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 107 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "07.04.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(захтр)л\nЗахист трудових прав працівників (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "08.04.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 402 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "09.04.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "10.04.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(псз)л\nПраво соціального забезпечення (Л)",
//                     "teacher": "Кохан Н.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(квп)л\nКримінально-виконавче право (Л)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "11.04.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 113 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "21.04.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "22.04.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне право України (Л)",
//                     "teacher": "Банасевич І.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 402 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "23.04.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "24.04.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "25.04.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (Л)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 308 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "28.04.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне право України (Л)",
//                     "teacher": "Медицький І.Б.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "29.04.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 209 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nКримінальне процесуальне право України (Л)",
//                     "teacher": "Микитин Ю.І.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 406 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "30.04.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35\nЦивільне процесуальне право України (Л)",
//                     "teacher": "Кузьмич О.Я.",
//                     "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "01.05.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "Збірна група ПР(квп)л\nКримінально-виконавче право (Л)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "",
//                     "details": "ауд. 404 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "02.05.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (Л)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 308 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "05.05.2025",
//             "day": "Понеділок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Цивільне процесуальне право України (ПрС)",
//                     "teacher": "Петечел Н.М.",
//                     "group": "",
//                     "details": "ауд. 0-100 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "06.05.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 113 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "08.05.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "09.05.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 111 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "13.05.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 208 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "14.05.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "15.05.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "16.05.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 111 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "20.05.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 208 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "21.05.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "22.05.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "23.05.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 111 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 304 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "27.05.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 208 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "28.05.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 210 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "29.05.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Збірна група ПР(квп)2\nКримінально-виконавче право (ПрС)",
//                     "teacher": "Кернякевич-Танасійчук Ю.В.",
//                     "group": "ПР(квп)2",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "30.05.2025",
//             "day": "П'ятниця",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 111 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "03.06.2025",
//             "day": "Вівторок",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Цивільне право України (ПрС)",
//                     "teacher": "Схаб-Бучинська Т.Я.",
//                     "group": "",
//                     "details": "ауд. 208 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "04.06.2025",
//             "day": "Середа",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "Кримінальне право України (ПрС)",
//                     "teacher": "Шпіляревич В.В.",
//                     "group": "",
//                     "details": "ауд. 210 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         },
//         {
//             "date": "05.06.2025",
//             "day": "Четвер",
//             "lessons": [
//                 {
//                     "time": "09:00-10:20",
//                     "subject": "Збірна група ПР(викпр)\nВиконавче провадження (ПрС)",
//                     "teacher": "Логвінова М.В.",
//                     "group": "",
//                     "details": "ауд. 103 кор. Шевченка, 44а",
//                     "link": ""
//                 },
//                 {
//                     "time": "10:35-11:55",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "12:20-13:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "13:50-15:10",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 },
//                 {
//                     "time": "15:20-16:40",
//                     "subject": "",
//                     "teacher": "",
//                     "group": "",
//                     "details": "",
//                     "link": ""
//                 }
//             ]
//         }
//     ]
// }
// };